Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The header files are used during compilation, with the compiled binary dependency being used during the linking.
zh_cn: 这些头文件在编译期间使用，而编译的二进制依赖则在链接过程中使用。

source: The information stored in the metadata cache includes:
zh_cn: 存储在元数据缓存中的信息包括：

source: The job of initialising the CUnit test registry and executing the tests is performed by Gradle, via some generated CUnit launcher sources.
zh_cn: 初始化 CUnit 测试注册以及执行这些测试的工作，都由 Gradle 通过一些生成的 CUnit 启动器源码来执行。

source: The key to pass to Jetty when requesting it to stop.
zh_cn: 当需要请求停止时，传递给 Jetty 的key。

source: The latter is based on files, e.g. the physical location of the test implementation class.
zh_cn: 后者基于文件，比如测试实现类的物理位置。

source: The latter is the default, and is used to report build progress.
zh_cn: 默认使用后面的这个日志级别，用于报告构建进度。

source: The latter is used to load and execute the Groovy compiler and Groovydoc tool, respectively, and should only contain the Groovy library and its dependencies.
zh_cn: 后者用来分别加载和执行 Groovy 编译器和 Groovydoc 工具，并且应该只包含 Groovy 库及其依赖项。

source: The latter is used to load and execute the Scala compiler and Scaladoc tool, respectively, and should only contain the scala-compiler library and its dependencies.
zh_cn: 后者用来分别加载和执行 Scala 编译器和 Scala 工具，并且应该只包含 scala-library及其依赖项。

source: The latter may be completely replaced in future.
zh_cn: 后者可能在将来会被完全地取代掉。

source: The libraries can be stored in a flat directory without any XML module descriptor files.
zh_cn: 库可以存在一个平面目录中，而没有任何 XML 模块描述符文件。

source: The location of those directories are considered as child projects of the root project in the multi-project tree.
zh_cn: 这些目录的位置被认为是多项目树中根项目的子项目。

source: The lock is held whenever the binary meta-data store is being read or written, but is released for slow operations such as downloading remote artifacts.
zh_cn: 每当二进制元数据存储区正在读取或写入时，锁都会被持有，但会在慢的操作比如下载远程工作时释放。

source: The log is the main 'UI' of a build tool.
zh_cn: 日志是构建工具的主要界面。

source: The main difference between a dynamic version and a changing module is that when you resolve a dynamic version, you'll get the real, static version as the module name.
zh_cn: 动态版本和变化模块的主要区别是，当你解析一个动态版本时，你会得到真正的、 静态的版本作为模块名称。

source: The main tasks that you will use are the eclipse and cleanEclipse tasks.
zh_cn: 您将使用的主要任务是eclipse和cleanEclipse任务。

source: The main tasks that you will use are the idea and cleanIdea tasks.
zh_cn: 您将使用的主要任务是 idea 和 cleanIdea 任务。

source: The manifest to include in all JAR files.
zh_cn: 要包括的所有 JAR 文件的清单。

source: The map may include other artifact properties:
zh_cn: 这个map可能包含其他的构件属性：

source: The map must include a file entry that defines the file.
zh_cn: 这个 map 必须包含一个定义文件的 file 条目。

source: The mapping works like the following.
zh_cn: 映射过程像下面所示。

source: The maven plugin provides a factory method for creating a POM. This is useful if you need a POM without the context of uploading to a Maven repo.
zh_cn: Maven 插件提供了用于创建 POM 的工厂方法，如果你需要一个 POM 文件但是没有上传到 Maven 仓库的场景，这个工厂方法将非常有用。

source: The merge is not immediately triggered by the from statement.
zh_cn: 这个合并操作不会在from语句中就马上被触发。

source: The method call returns the Ant data type, which you can then use directly in your build script.
zh_cn: 方法调用返回 Ant 数据类型，然后可以在构建脚本中直接使用。

source: The model objects provide lower level hooks for working with domain objects representing the file content before and after merging with the model configuration.
zh_cn: 模型对象提供了低级别的hook，用于处理在合并模型配置前后表示文件内容的域对象。

source: The most common use case is to have multi-project builds that share a common lifecycle (e.g. all projects use the Java plugin).
zh_cn: 最常见的用例是，要分享共同的生命周期（例如所有项目都使用 Java 插件） 的多项目构建。

source: The most popular ones at the moment are Maven and Ivy.
zh_cn: 目前最受欢迎的解决方案是 Maven 和 Ivy。

source: The multi-project tree created in the settings file is made up of so called project descriptors.
zh_cn: 在设置文件中创建的多项目树组成了所谓的项目描述符。

source: The name and version of the project
zh_cn: project的名称和版本

source: The name of the application source directory, relative to the project directory.
zh_cn: 相对于项目目录的应用程序源目录名称。

source: The name of the archive can also be changed at any time later on.
zh_cn: 还可以在以后的任何时候更改归档文件的名称。

source: The name of the directory to generate distributions into, relative to the build directory.
zh_cn: 相对于build目录的目录名称，发布的文件将生成到此目录中。

source: The name of the directory to generate documentation into, relative to the build directory.
zh_cn: 相对于build目录的目录名称，文档将生成到此目录。

source: The name of the directory to generate libraries into, relative to the build directory.
zh_cn: 相对于build目录的目录名称，类库将生成到此目录中。

source: The name of the directory to generate reports into, relative to the build directory.
zh_cn: 相对于build目录的目录名称，报告将生成到此目录。

source: The name of the directory to generate test result .xml files into, relative to the build directory.
zh_cn: 相对于build目录的目录名称，测试报告的.xml文件将生成到此目录。

source: The name of the directory to generate the project report into, relative to the reports directory.
zh_cn: 生成项目报告的目录名称，它是相对于reports目录的相对路径。

source: The name of the directory to generate the test report into, relative to the reports directory.
zh_cn: 相对于reports目录的目录名称，测试报告将生成到此目录。

source: The name of the directory to use to cache source dependency information, relative to the build directory.
zh_cn: 相对于build目录的目录名称，该目录用于缓存源代码的依赖信息。

source: The name of the lib directory inside the generated EAR.
zh_cn: 生成的 EAR 文件里的 lib 目录名称。

source: The name of the project directory.
zh_cn: 项目目录的名称。

source: The name of the source set, used to identify it.
zh_cn: 用来确定一个源集的源集名称。

source: The name of the web application source directory, relative to the project directory.
zh_cn: web 应用程序源目录的名称，是一个相对于项目目录的目录名称。

source: The next example demonstrates latest selectors based on a custom status scheme declared in a module metadata rule:
zh_cn: 下一个示例演示了基于在一个模块的元数据规则中声明的自定义状态模式的latest选择器：

source: The next time you run this build, Gradle uses the compiled script, if the script has not changed since it was compiled.
zh_cn: 下次你运行此构建时， 如果该脚本自它编译后没有被修改，Gradle 会使用这个已编译的脚本。

source: The only difference is the pattern, which is org.gradle.project.propertyName.
zh_cn: 唯一的区别是，它是org.gradle.projectpropertyName的模式。

source: The ordering rule only has an effect when both tasks are scheduled for execution.
zh_cn: 排序规则仅在这两项任务计划执行时起作用。

source: The original configuration has therefore a version conflict which is resolved to the newer seal-2.0 version.
zh_cn: 原始配置因此有版本冲突，所以被解析为更新的 seal-2.0 版本。

source: The other arguments form the value.
zh_cn: 其他参数构成了它的值。

source: The other is a Networking Properties page from the JDK docs.
zh_cn: 另一个地方是 JDK 文档的网络属性页。

source: The other manifests might be either described by a file path or, like in the example above, by a reference to another Manifest object.
zh_cn: 其他的manifest可能使用文件路径来描述，像上面的例子，使用对另一个Manifest对象的引用。

source: The other results currently cannot be disabled.
zh_cn: 目前不能禁用其他的结果。

source: The other statement uses the project property available to any build script, which returns the associated Project object.
zh_cn: 其他语句使用了在任何构建脚本中可以访问的project属性，则返回关联的Project对象。

source: The other type of task is the enhanced task, where the behaviour is built into the task, and the task provides some properties which you can use to configure the behaviour.
zh_cn: 另一种类型的任务是增强型的任务，它的任务内置在任务中，并且这个任务提供了一些属性能够让你用于配置其行为。

source: The output files of the TaskOutputs are included in the file collection.
zh_cn: TaskOutputs 的输出文件会被包含在文件集合内。

source: The output files of the source set, containing its compiled classes and resources.
zh_cn: 源集的输出文件，包含它编译过的类和资源。

source: The output files of the task are included in the file collection.
zh_cn: 任务的输出文件会被包含在文件集合内。

source: The passphrase used to protect your private key.
zh_cn: 用来保护你的私钥的密码。

source: The path :bluewhale corresponds to the file system path water/bluewhale in the case of the example above.
zh_cn: 在上面的示例中，该路径:bluewhale对应于文件系统路径water/bluewhale。

source: The path of a task is simply its project path plus the task name.
zh_cn: 一项任务的路径只是它的项目路径加上其任务名称。

source: The path of the directory to write the generated POMs, relative to the build directory.
zh_cn: 相对于构建目录，用于写入生成的POM的文件夹路径。

source: The paths of the dependencies in the generated IDEA files are absolute.
zh_cn: 在生成的 IDEA 文件的依赖项路径是绝对路径。

source: The patterns are used in the order that they are defined.
zh_cn: 这些模式以定义它们的顺序来使用。

source: The plugin adds a sonarAnalyze task that analyzes the project to which the plugin is applied, as well as its subprojects.
zh_cn: 该插件添加了sonarAnalyze task ，用来分析一个project 及子project 都应用了哪个插件。

source: The plugin adds a number of tasks to the project that perform the quality checks.
zh_cn: 该插件向你的项目添加了大量的执行质量检查的任务。

source: The plugin adds an extension named "distributions" of type DistributionContainer to the project.
zh_cn: 本插件向 project 添加了一个名为“distributions” 的 DistributionContainer 类型的扩展。

source: The plugin adds the following tasks to the project:
zh_cn: 该插件向project 中添加了以下任务：

source: The plugin build a distribution for your library.
zh_cn: 该插件还可以生成你的 library 的分发文件。

source: The plugin can also build a distribution for your application.
zh_cn: 该插件还可以生成你的应用程序的分发文件。

source: The plugin is based on Sonar Runner 2.0, which makes it compatible with Sonar 2.11 and higher.
zh_cn: 该插件基于Sonar Runner 2.0，这使它与Sonar 2.11 或更高的版本相兼容。

source: The plugin is based on the Sonar Runner and requires Sonar 2.11 or higher.
zh_cn: 该插件基于Sonar Runner，并要求是 Sonar 2.11 或更高的版本。

source: The plugin provides a DSL for configuring model objects that model the Eclipse view of the project.
zh_cn: 该插件提供一个 DSL，用于配置把该 project 的Eclipse 视图做成模型的模型对象。

source: The plugin provides a standardized set of hooks for adding and removing content from the generated files.
zh_cn: 该插件提供了一套标准化的 hooks 用于添加和删除生成的文件的内容。

source: The plugin provides objects modeling the sections of the metadata files that are generated by Gradle.
zh_cn: 本插件提供了一些对象，对由 Gradle 生成的元数据文件的这一部分内容进行建模。

source: The plugin supports joint compilation, which allows to freely mix and match Groovy and Java code, with dependencies in both directions.
zh_cn: 该插件支持联合编译，可以任意地混合及匹配Groovy 和 Java 代码各自的依赖。

source: The plugin supports joint compilation, which allows to freely mix and match Scala and Java code, with dependencies in both directions.
zh_cn: 该插件支持联合编译，联合编译可以通过 Scala 及 Java 的各自的依赖任意地混合及匹配它们的代码。

source: The powerful support for multi-project builds is one of Gradle's unique selling points.
zh_cn: 对多项目构建的强大支持是 Gradle 的独特优点之一。

source: The predicate is evaluated just before the task is due to be executed.
zh_cn: 断言只在任务要执行前才计算。

source: The primary difference between a task ordering and a task dependency is that an ordering rule does not influence which tasks will be executed, only the order in which they will be executed.
zh_cn: 任务排序和任务依赖之间的主要区别是，排序规则不会影响那些任务的执行，而仅将执行的顺序。

source: The project classpath becomes a complete mess, and, if a classpath problem arises, hell on earth invites you for a ride.
zh_cn: 项目的类路径会变得一片狼藉，并且，如果类路径出现问题时，那简直就是人间地狱。

source: The project object provides a LoggingManager, which allows you to change the log levels that standard out or error are redirected to when your build script is evaluated.
zh_cn: Project对象提供了一个LoggingManager，它可以在评估构建脚本时，修改标准输出和错误重定向的日志级别。

source: The project path is assumed to be equal to the relative physical file system path.
zh_cn: 项目路径被假定为等于物理文件系统的相对路径。

source: The project report defines the following convention properties:
zh_cn: 项目报告定义以下约定属性：

source: The project report plugin defines the following tasks:
zh_cn: 项目报告插件定义了以下任务：

source: The project report plugin does not define any dependency configurations.
zh_cn: 项目报告插件没有定义任何的依赖配置。

source: The project report plugin does not require any particular project layout.
zh_cn: 项目报告插件不需要任何特定的项目布局。

source: The project tree is created in the settings.gradle file.
zh_cn: 项目树在settings.gradle文件中创建。

source: The projects to generate the reports for.
zh_cn: 要生成报告的projects。

source: The properties are described below.
zh_cn: 这些属性将在下文中进行介绍。

source: The properties file in the user's home directory has precedence over property files in the project directories.
zh_cn: 用户的主目录中的属性文件比项目目录中的属性文件更先被访问到。

source: The properties of the gradle.properties can be accessed via the project object.
zh_cn: 通过project对象，可以访问到gradle.properties里的属性。

source: The public key ID (an 8 character hexadecimal string).
zh_cn: 公钥 ID （一个8位字符的十六进制字符串）。

source: The reason every project needs to be configured is to support the flexibility of accessing and changing any part of Gradle project model.
zh_cn: 每个项目需要配置的原因是为了支持灵活地访问及更改 Gradle 项目模型的任何部分。

source: The reason is, that Gradle adds a set of default imports to your script.
zh_cn: 原因是，Gradle 会向您的脚本添加默认的一些导入。

source: The remaining sections will be left as-is.
zh_cn: 剩余的部分则不变。

source: The replaced manifest is merged into the new one.
zh_cn: 被替换的manifest 会被合并到新的对象单中。

source: The report is available at $buildDir/reports/jacoco/test.
zh_cn: 该报告可以在 $buildDir/reports/jacoco/test 中看到。

source: The repositories you have defined (as described in Section 50.6, “Repositories”) are not automatically used for uploading.
zh_cn: 你所定义的仓库（第 50.6 节，“仓库”所描述的）并不会自动地用于上传。

source: The resolved artifact metadata for a particular artifact, including a pointer to the downloaded artifact file.
zh_cn: 对于特定构件的解析后的构件元数据，包括指向下载的构件工件的信息。

source: The resolved module metadata for a particular module, including module artifacts and module dependencies.
zh_cn: 对于特定模块的解析后的模块元数据，包括模块构件和模块依赖。

source: The resources of this source set.
zh_cn: 此源集的资源文件。

source: The result of resolving a dynamic version (e.g. 1.+) to a concrete version (e.g. 1.2).
zh_cn: 解析一个动态版本（例如1.+）到一个具体的版本（例如1.2）的结果。

source: The resulting .classpath file will only contain Gradle-generated dependency entries, but not any other dependency entries that may have been present in the original file.
zh_cn: 生成的.classpath文件将只包含 Gradle 生成的依赖项，而没有其他可能存在于原始文件的依赖项。

source: The resulting module file will only contain Gradle-generated dependency entries, but not any other dependency entries that may have been present in the original file.
zh_cn: 生成的模块文件将只包含 Gradle 生成的依赖项，而没有其他可能存在于原始文件的依赖项。

source: The results are stored in the Sonar database.
zh_cn: 分析结果存储于 Sonar 数据库中。

source: The results in an XML format that is compatible with the Ant JUnit report task.
zh_cn: 与Ant Junit report 任务兼容的 XML 格式的结果。

source: The results of this analysis are stored in the file designated by scalaCompileOptions.incrementalOptions.analysisFile (which has a sensible default).
zh_cn: 解析结果进入由 scalaCompileOptions.incrementalOptions.analysisFile 所指定的文件（它有一个合理的默认值）。

source: The return value can be an object of any of the types supported by the files() method.
zh_cn: 这个闭包或Callable实例的返回值可以是files()方法所支持的任何类型的对象。

source: The root project is the only project in a path that is not specified by its name.
zh_cn: 根项目是唯一的在一个不由其名称指定的路径中的项目。

source: The rule provided will enforce just this: any time version 1.2 is encountered it will be replaced with 1.2.1.
zh_cn: 提供的规则将强制执行：在任何时间遇到了1.2版本，都将会替换为1.2.1。

source: The same could be done for the module paths in the project file:
zh_cn: 对项目文件中的模块路径的处理也是一样：

source: The same could be done for the natures in the .project file:
zh_cn: 对.project文件中的natures的处理也是一样：

source: The same hooks can be used to add additional properties which aren't covered by the plugin's object model.
zh_cn: 相同的hook 可以用来添加额外的属性，并且不会被插件的对象模型所覆盖。

source: The second layer of Ant is its wealth of Ant tasks and types, like javac, copy or jar.
zh_cn: Ant 的第二层是其丰富的 Ant 任务和类型，如javac、copy或jar。

source: The section contains information on how to configure certain behavior of the daemon (including turning on the daemon by default) in a more 'persistent' way.
zh_cn: 这一章节包含了有关如何以一种“持久化”的方式配置某些行为（包括在默认情况下打开守护进程）的信息。

source: The separation that Ant does between tasks and targets is not done by Gradle.
zh_cn: Gradle 没有像 Ant 那样对任务和目标进行分离。

source: The setting is particularly useful for tweaking memory settings.
zh_cn: 该设置对调整内存设置特别有用。

source: The settings file gets executed during the initialization phase.
zh_cn: 这个配置文件会在初始化阶段执行。

source: The settings file is determined by Gradle via a naming convention.
zh_cn: 这个设置文件是由 Gradle 通过一种命名约定来决定的。

source: The signature file will be placed alongside the artifact being signed.
zh_cn: 签名文件将和被签名的 artifact 放在一起。

source: The signature files will be placed alongside the artifacts being signed.
zh_cn: 签名文件将和被签名的artifacts放在一起。

source: The signing plugin adds a signing.signPom() (see: SigningExtension.signPom()) method that can be used in the beforeDeployment() block in your upload task configuration.
zh_cn: 签名插件添加了一个signing.signPom() （请参见： SigningExtension.signPom()）方法，这个方法可以在你的上传任务配置的beforeDeployment()块中使用。

source: The signing plugin adds the ability to digitally sign built files and artifacts.
zh_cn: 签名插件添加了对构件的文件和artifacts进行数字签名的功能。

source: The signing plugin currently only provides support for generating PGP signatures (which is the signature format required for publication to the Maven Central Repository).
zh_cn: 签名插件目前只提供了生成PGP 签名的支持（这是发布到Maven 中央库所需的签名格式）。

source: The simple Gradle tasks are like Ant's targets and the enhanced Gradle tasks also include the Ant task aspects.
zh_cn: 简单的 Gradle 任务就像 Ant 的目标，而增强的 Gradle 任务还包括 Ant 任务方面的内容。

source: The simple rule mentioned already above is: Execute all tasks down the hierarchy which have this name.
zh_cn: 上面已经提到的简单的规则是︰ 执行在该层次结构下具体该名字的所有任务。

source: The skip Sonar analysis for a particular subproject, set sonarRunner.skipProject.
zh_cn: 对于一个特定的子项目，要跳过 Sonar 分析，可以设置sonarRunner.skipProject。

source: The source directories containing the ANTLR grammar files of this source set.
zh_cn: 该源目录包含该 source set 中的 ANTLR 语法文件。

source: The source directories containing the Groovy source files of this source set.
zh_cn: 源目录包含该 source set 中的 Groovy 源文件。

source: The source directories containing the Java source files of this source set.
zh_cn: 该源目录包含了此源集的所有Java源文件。

source: The source directories containing the Scala source files of this source set.
zh_cn: 源目录包含该 source set 中的 Scala 源文件。

source: The source directories containing the resources of this source set.
zh_cn: 该源目录包含了此源集的资源文件。

source: The source set container works pretty much the same way as other containers, such as tasks.
zh_cn: 源集容器的使用方式几乎与其他容器一样，例如tasks。

source: The standard project dependencies are supported and makes relevant projects configured.
zh_cn: 标准项目的依赖也被支持，并且使相关的项目也被配置。

source: The storage path for a downloaded artifact includes the SHA1 checksum, meaning that 2 artifacts with the same name but different content can easily be cached.
zh_cn: 下载的构件的存储路径包括了 SHA1 校验和，意味着 2 个具有相同名称但内容不同的构件可以很容易地被缓存。

source: The subset is determined by the task name arguments passed to the gradle command and the current directory.
zh_cn: 这个子集是由传递给gradle命令的任务名称参数和当前目录所决定的。

source: The suppleness and richness of Gradle finally allows you to apply common design principles to your build.
zh_cn: Gradle的灵活和丰富性最终能够让你将觉的设计原则应用到你的构建当中。

source: The supplied object's toString() value is used as the file path.
zh_cn: 而所提供的这个对象的tostring()方法的值会作为文件路径。

source: The supported tool chain types are:
zh_cn: 支持的工具链类型有︰

source: The task aggregates the reports for all tasks that implement the Reporting interface from all projects in the build.
zh_cn: 该任务为在 all projects 中实现了 Reporting 接口的所有任务聚合了报告。

source: The task can be configured using its API (see Copy).
zh_cn: 可以使用它的 API 来配置这个任务 （见Copy）。

source: The task class is visible to every build script used by the build.
zh_cn: 这个任务类在该构建所使用的每一个构建脚本当中都是可见的。

source: The task dependencies declared via task path are supported and cause relevant projects configured.
zh_cn: 通过任务路径定义的任务依赖也被支持，并且会导致相关的项目被配置。

source: The task generates the other results from these binary results.
zh_cn: 这个任务会从这些二进制结果生成其他的结果。

source: The task has an ignoreFailures property to control the behavior when tests fail.
zh_cn: 该任务有一个ignoreFailures属性，用以控制测试失败时的行为。

source: The task is added by the Base plugin which is implicitly applied by the Java plugin.
zh_cn: 该任务由Base插件添加，并由Java插件隐式实现。

source: The task type extends the JavaCompile task (see Section 23.11, “CompileJava”).
zh_cn: 这个task 的类型继承自JavaCompile task（见第 23.11 节，“CompileJava”）。

source: The task's inputs property is of type TaskInputs.
zh_cn: 任务的 inputs 属性是 TaskInputs类型。

source: The task's outputs property is of type TaskOutputs.
zh_cn: 任务的 outputs 属性是 TaskOutputs类型。

source: The task's actions are only executed if the predicate evaluates to true.
zh_cn: 如果断言结果为 true，才会执行任务的操作。

source: The tasks recognize existing IDEA files, and merge them with the generated content.
zh_cn: 该任务会识别现有的 IDEA 文件，并将它们与生成的内容进行合并。

source: The tasks which produce the artifacts in configuration ConfigurationName.
zh_cn: 使用配置ConfigurationName生成构件的任务。

source: The tasks which produce the artifacts in the archives configuration, including jar.
zh_cn: 使用archives的配置生成构件的任务，包括jar。

source: The tasks which uploads the artifacts in configuration ConfigurationName.
zh_cn: 使用配置ConfigurationName上传构件的任务。

source: The test process sets the org.gradle.test.worker system property to a unique identifier for that test process, which you can use, for example, in files names or other resource identifiers.
zh_cn: 测试进程程会为其将org.gradle.test.worker系统属性设置为一个唯一标识符，这个标识符可以用于文件名称或其他资源标识符。

source: The test task provides a Test.getDebug() property that can be set to launch to make the JVM wait for a debugger to attach to port 5005 before proceeding with test execution.
zh_cn: test任务提供了一个Test.getDebug()属性，可以设置为启动，使JVM在执行测试之前，等待一个debugger连接到它的5005端口上。

source: The trick is to use only artifact dependencies and group them in lists.
zh_cn: 诀窍是只使用构件依赖，并在列表中对它们进行分组。

source: The type is specified by supplying a --type argument value.
zh_cn: 类型通过提供一个 --type 参数值指定。

source: The value can be set to either jdk or jre location, however, depending on what does your build do, jdk is safer.
zh_cn: 这个值可以设置为jdk或jre的位置，不过，根据你的构建所做的，选择 jdk会更安全。

source: The various native binary plugins add support for building native software components from C++, C, Objective-C, Objective-C++ and Assembler sources.
zh_cn: 不同的原生二进制插件添加了对从C++，C，Objective-C，Objective-C++以及汇编源文件构建原生软件组件的支持。

source: The version of a library must be easy to recognize in the filename.
zh_cn: 在文件名中库的版本必须是容易辨认的。

source: The version portion of the archive file name.
zh_cn: 归档文件的名称中的版本部分。

source: The web application source directory.
zh_cn: Web 应用程序的源目录。

source: The workspace file can effectively only be manipulated via the withXml hook because its corresponding domain object is essentially empty.
zh_cn: 工作区文件可以有效地只通过withXml hook 来操作，因为其相应的域对象实际上是空的。

source: The wrapper plugin adds the following tasks to the project:
zh_cn: Wrapper 插件向project 中添加了以下任务：

source: The wrapper plugin is currently incubating.
zh_cn: Wrapper 插件目前还是孵化中状态。

source: Then Gradle looks for tasks with names equal to those passed as command line arguments.
zh_cn: 然后 Gradle 会查找与命令行传进来的参数相同的任务名。

source: Then we will look at creating a standalone project.
zh_cn: 然后我们会看看创建一个单独的项目的方式。

source: Then you could move your dependency declarations from the Ant script to your build file.
zh_cn: 然后，可以将您的依赖声明从 Ant 脚本移到您的构建文件。

source: Then, according to the task name arguments and the current dir, Gradle filters the tasks which should be executed.
zh_cn: 然后，根据任务名称参数和当前目录，Gradle 过滤出应该执行的任务。

source: Then, you can run the application by running gradle run.
zh_cn: 然后，你可以通过执行 gradle run 来运行这个应用程序。

source: There are 2 ways that you can provide the domain for authenticating to a NTLM proxy:
zh_cn: 有两种方法可以向 NTLM 代理提供验证域：

source: There are Gradle builds with a hierarchy of hundreds of subprojects.
zh_cn: 存在着一些项目，它们在层次结构上有上百个的子项目。

source: There are a few variations on this style, which you may need to use in certain situations.
zh_cn: 在某些情况中，你可能需要使用这种关键字风格的几种不同的变式。

source: There are a number of plugins included in the Gradle distribution.
zh_cn: Gradle 的发行包中有大量的插件。
